---
kind: property
id: P:Autodesk.Revit.DB.RoutingPreferenceManager.OwnerId
source: html/b5870814-9de7-9b7d-783a-550b012239e6.htm
---
# Autodesk.Revit.DB.RoutingPreferenceManager.OwnerId Property

The Id of the MEPCurveType that owns the RoutingPreferenceManager

## Syntax (C#)
```csharp
public ElementId OwnerId { get; }
```